Autodesk.Revit.DB.BuiltInFailures.MultiReferenceAnnotationFailures.MultiReferenceAnnotationReferenceCategoryForcesDeletion
Changing the reference category will cause instances of this annotation type to be deleted, because they no longer match their references.

Autodesk.Revit.DB.BuiltInFailures.MultiReferenceAnnotationFailures.ElementCategoryChangeInvalidatesMultiReferenceAnnotation
Elements have changed category. Multi-rebar annotations for these elements are now of the wrong category and will be deleted.

Autodesk.Revit.DB.BuiltInFailures.MultiReferenceAnnotationFailures
Failures about MultiReferenceAnnotations.